# DimensionType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Dimension..::..DimensionType Property
Dimension Class See Also
---
The dimension style of this dimension.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public DimensionType DimensionType { get; set; }
```

Visual Basic
---
```text
Public Property DimensionType As DimensionType
	Get
	Set
```

Visual C++
---
```text
public:
property DimensionType^ DimensionType {
	DimensionType^ get ();
	void set (DimensionType^ value);
}
```

# See Also
Dimension Class
Autodesk.Revit.DB Namespace